# Brewfile - Full installation
# Install with: brew bundle
# Update with: brew bundle dump --force

# Taps
tap "bramstein/webfonttools"
tap "homebrew/cask-fonts"

# =============================================================================
# Core Tools
# =============================================================================

# Shell
brew "zsh"

# Version control
brew "git"
brew "git-extras"
brew "git-delta"
brew "gh"
brew "lazygit"

# Editor
brew "neovim"

# Terminal multiplexer
brew "tmux"

# =============================================================================
# Modern CLI Replacements
# =============================================================================

brew "eza"          # ls replacement
brew "bat"          # cat replacement
brew "fd"           # find replacement
brew "ripgrep"      # grep replacement
brew "zoxide"       # cd replacement
brew "bottom"       # top replacement (btm)
brew "dust"         # du replacement
brew "curlie"       # curl replacement
brew "procs"        # ps replacement
brew "sd"           # sed replacement
brew "choose-rust"  # awk/cut replacement
brew "httpie"       # HTTP client

# =============================================================================
# Fuzzy Finding & Navigation
# =============================================================================

brew "fzf"
brew "navi"         # Cheatsheet widget
brew "atuin"        # Shell history

# =============================================================================
# File Management
# =============================================================================

brew "yazi"         # TUI file manager
brew "glow"         # Markdown viewer
brew "jq"           # JSON processor
brew "yq"           # YAML processor

# =============================================================================
# Development Tools
# =============================================================================

# Languages
brew "go"
brew "node"
brew "python"
brew "nvm"

# Package managers
brew "yarn"
brew "pnpm"

# Build tools
brew "cmake"
brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"
brew "moreutils"

# Security
brew "gnupg"
brew "pinentry-mac"
brew "openssh"

# Utilities
brew "wget"
brew "tree"
brew "htop"
brew "tldr"
brew "just"         # Task runner
brew "direnv"
brew "pre-commit"
brew "neofetch"

# Kubernetes
brew "k9s"
brew "kubectl"
brew "kubectx"

# Cloud
brew "awscli"

# =============================================================================
# Fonts
# =============================================================================

brew "fontconfig"
brew "sfnt2woff"
brew "sfnt2woff-zopfli"
brew "woff2"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# =============================================================================
# macOS Applications
# =============================================================================

cask "alacritty"
cask "keepingyouawake"
cask "rectangle"      # Window management (Spectacle successor)
cask "appcleaner"
cask "raycast"
cask "hiddenbar"
cask "docker"
cask "vlc"
cask "spotify"
cask "visual-studio-code"
cask "1password"      # Optional: password manager
