
romkatv/powerlevel10k

getantidote/use-omz
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/extract
ohmyzsh/ohmyzsh path:plugins/magic-enter
ohmyzsh/ohmyzsh path:plugins/globalias
ohmyzsh/ohmyzsh path:plugins/fancy-ctrl-z
ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/safe-paste
ohmyzsh/ohmyzsh path:plugins/command-not-found

ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/golang
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/macos conditional:is-macos

ahmetb/kubectx path:completion kind:fpath

belak/zsh-utils path:history
belak/zsh-utils path:utility
belak/zsh-utils path:editor

djui/alias-tips
jeffreytse/zsh-vi-mode 

zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-completions path:src kind:fpath
zsh-users/zsh-autosuggestions
zsh-users/zsh-history-substring-search
belak/zsh-utils path:completion
Aloxaf/fzf-tab